mdepx/mdepx/arch/arm/raspberrypi/rp2040_dma_regs.h
#define RP2040_DMA_INTR                       (RP2040_DMA_BASE + RP2040_DMA_INTR_OFFSET)
#define RP2040_DMA_INTE0                      (RP2040_DMA_BASE + RP2040_DMA_INTE0_OFFSET)
#define RP2040_DMA_INTF0                      (RP2040_DMA_BASE + RP2040_DMA_INTF0_OFFSET)
#define RP2040_DMA_INTS0                      (RP2040_DMA_BASE + RP2040_DMA_INTS0_OFFSET)
#define RP2040_DMA_INTE1                      (RP2040_DMA_BASE + RP2040_DMA_INTE1_OFFSET)
#define RP2040_DMA_INTF1                      (RP2040_DMA_BASE + RP2040_DMA_INTF1_OFFSET)
#define RP2040_DMA_INTS1                      (RP2040_DMA_BASE + RP2040_DMA_INTS1_OFFSET)
#define RP2040_DMA_TIMER0                     (RP2040_DMA_BASE + RP2040_DMA_TIMER0_OFFSET)
#define RP2040_DMA_TIMER1                     (RP2040_DMA_BASE + RP2040_DMA_TIMER1_OFFSET)
#define RP2040_DMA_TIMER2                     (RP2040_DMA_BASE + RP2040_DMA_TIMER2_OFFSET)
#define RP2040_DMA_TIMER3                     (RP2040_DMA_BASE + RP2040_DMA_TIMER3_OFFSET)
#define RP2040_DMA_MULTI_CHAN_TRIGGER         (RP2040_DMA_BASE + RP2040_DMA_MULTI_CHAN_TRIGGER_OFFSET)
#define RP2040_DMA_SNIFF_CTRL                 (RP2040_DMA_BASE + RP2040_DMA_SNIFF_CTRL_OFFSET)
#define RP2040_DMA_SNIFF_DATA                 (RP2040_DMA_BASE + RP2040_DMA_SNIFF_DATA_OFFSET)
#define RP2040_DMA_FIFO_LEVELS                (RP2040_DMA_BASE + RP2040_DMA_FIFO_LEVELS_OFFSET)
#define RP2040_DMA_CHAN_ABORT                 (RP2040_DMA_BASE + RP2040_DMA_CHAN_ABORT_OFFSET)
#define RP2040_DMA_N_CHANNELS                 (RP2040_DMA_BASE + RP2040_DMA_N_CHANNELS_OFFSET)

#define RP2040_DMA_DBG_CTDREQ(n)              (RP2040_DMA_BASE + RP2040_DMA_DBG_CTDREQ_OFFSET(n))
#define RP2040_DMA_DBG_TCR(n)                 (RP2040_DMA_BASE + RP2040_DMA_DBG_TCR_OFFSET(n))

/* Register bit definitions *************************************************/

#define RP2040_DMA_CTRL_TRIG_AHB_ERROR                     (1 << 31)  /* Logical OR of the READ_ERROR and WRITE_ERROR flags. The channel halts when it encounters any bus error, and always raises its channel IRQ flag. */
#define RP2040_DMA_CTRL_TRIG_READ_ERROR                    (1 << 30)  /* If 1, the channel received a read bus error. Write one to clear. READ_ADDR shows the approximate address where the bus error was encountered (will not to be earlier, or more than 3 transfers later) */
#define RP2040_DMA_CTRL_TRIG_WRITE_ERROR                   (1 << 29)  /* If 1, the channel received a write bus error. Write one to clear. WRITE_ADDR shows the approximate address where the bus error was encountered (will not to be earlier, or more than 5 transfers later) */
#define RP2040_DMA_CTRL_TRIG_BUSY                          (1 << 24)  /* This flag goes high when the channel starts a new transfer sequence, and low when the last transfer of that sequence completes. Clearing EN while BUSY is high pauses the channel, and BUSY will stay high while paused.  To terminate a sequence early (and clear the BUSY flag), see CHAN_ABORT. */
#define RP2040_DMA_CTRL_TRIG_SNIFF_EN                      (1 << 23)  /* If 1, this channel's data transfers are visible to the sniff hardware, and each transfer will advance the state of the checksum. This only applies if the sniff hardware is enabled, and has this channel selected.  This allows checksum to be enabled or disabled on a per-control- block basis. */
#define RP2040_DMA_CTRL_TRIG_BSWAP                         (1 << 22)  /* Apply byte-swap transformation to DMA data. For byte data, this has no effect. For halfword data, the two bytes of each halfword are swapped. For word data, the four bytes of each word are swapped to reverse order. */
#define RP2040_DMA_CTRL_TRIG_IRQ_QUIET                     (1 << 21)  /* In QUIET mode, the channel does not generate IRQs at the end of every transfer block. Instead, an IRQ is raised when NULL is written to a trigger register, indicating the end of a control block chain.  This reduces the number of interrupts to be serviced by the CPU when transferring a DMA chain of many small control blocks. */
#define RP2040_DMA_CTRL_TRIG_TREQ_SEL_SHIFT                (15)       /* Select a Transfer Request signal. The channel uses the transfer request signal to pace its data transfer rate. Sources for TREQ signals are internal (TIMERS) or external (DREQ, a Data Request from the system). 0x0 to 0x3a -> select DREQ n as TREQ */
#define RP2040_DMA_CTRL_TRIG_TREQ_SEL_MASK                 (0x3f << RP2040_DMA_CTRL_TRIG_TREQ_SEL_SHIFT)
#define RP2040_DMA_CTRL_TRIG_TREQ_SEL_TIMER0               (0x3b << RP2040_DMA_CTRL_TRIG_TREQ_SEL_SHIFT)  /* Select Timer 0 as TREQ */
#define RP2040_DMA_CTRL_TRIG_TREQ_SEL_TIMER1               (0x3c << RP2040_DMA_CTRL_TRIG_TREQ_SEL_SHIFT)  /* Select Timer 1 as TREQ */
#define RP2040_DMA_CTRL_TRIG_TREQ_SEL_TIMER2               (0x3d << RP2040_DMA_CTRL_TRIG_TREQ_SEL_SHIFT)  /* Select Timer 2 as TREQ (Optional) */
#define RP2040_DMA_CTRL_TRIG_TREQ_SEL_TIMER3               (0x3e << RP2040_DMA_CTRL_TRIG_TREQ_SEL_SHIFT)  /* Select Timer 3 as TREQ (Optional) */
#define RP2040_DMA_CTRL_TRIG_TREQ_SEL_PERMANENT            (0x3f << RP2040_DMA_CTRL_TRIG_TREQ_SEL_SHIFT)  /* Permanent request, for unpaced transfers. */
#define RP2040_DMA_CTRL_TRIG_CHAIN_TO_SHIFT                (11)                                           /* When this channel completes, it will trigger the channel indicated by CHAIN_TO. Disable by setting CHAIN_TO = _(this channel)_. Reset value is equal to channel number (0). */
#define RP2040_DMA_CTRL_TRIG_CHAIN_TO_MASK                 (0x0f << RP2040_DMA_CTRL_TRIG_CHAIN_TO_SHIFT)
#define RP2040_DMA_CTRL_TRIG_RING_SEL                      (1 << 10)  /* Select whether RING_SIZE applies to read or write addresses. If 0, read addresses are wrapped on a (1 << RING_SIZE) boundary. If 1, write addresses are wrapped. */
#define RP2040_DMA_CTRL_TRIG_RING_SIZE_SHIFT               (6)        /* Size of address wrap region. If 0, don't wrap. For values n > 0, only the lower n bits of the address will change. This wraps the address on a (1 << n) byte boundary, facilitating access to naturally-aligned ring buffers.  Ring sizes between 2 and 32768 bytes are possible. This can apply to either read or write addresses, based on value of RING_SEL. */
#define RP2040_DMA_CTRL_TRIG_RING_SIZE_MASK                (0x0f << RP2040_DMA_CTRL_TRIG_RING_SIZE_SHIFT)
#define RP2040_DMA_CTRL_TRIG_RING_SIZE_RING_NONE           (0x0 << RP2040_DMA_CTRL_TRIG_RING_SIZE_SHIFT)
#define RP2040_DMA_CTRL_TRIG_INCR_WRITE                    (1 << 5)   /* If 1, the write address increments with each transfer. If 0, each write is directed to the same, initial address.  Generally this should be disabled for memory-to-peripheral transfers. */
#define RP2040_DMA_CTRL_TRIG_INCR_READ                     (1 << 4)   /* If 1, the read address increments with each transfer. If 0, each read is directed to the same, initial address.  Generally this should be disabled for peripheral-to-memory transfers. */
#define RP2040_DMA_CTRL_TRIG_DATA_SIZE_SHIFT               (2)        /* Set the size of each bus transfer (byte/halfword/word). READ_ADDR and WRITE_ADDR advance by this amount (1/2/4 bytes) with each transfer. */
#define RP2040_DMA_CTRL_TRIG_DATA_SIZE_MASK                (0x03 << RP2040_DMA_CTRL_TRIG_DATA_SIZE_SHIFT)
#define RP2040_DMA_CTRL_TRIG_DATA_SIZE_SIZE_BYTE           (0x0 << RP2040_DMA_CTRL_TRIG_DATA_SIZE_SHIFT)
#define RP2040_DMA_CTRL_TRIG_DATA_SIZE_SIZE_HALFWORD       (0x1 << RP2040_DMA_CTRL_TRIG_DATA_SIZE_SHIFT)
#define RP2040_DMA_CTRL_TRIG_DATA_SIZE_SIZE_WORD           (0x2 << RP2040_DMA_CTRL_TRIG_DATA_SIZE_SHIFT)
#define RP2040_DMA_CTRL_TRIG_HIGH_PRIORITY                 (1 << 1)   /* HIGH_PRIORITY gives a channel preferential treatment in issue scheduling: in each scheduling round, all high priority channels are considered first, and then only a single low priority channel, before returning to the high priority channels.  This only affects the order in which the DMA schedules channels. The DMA's bus priority is not changed. If the DMA is not saturated then a low priority channel will see no loss of throughput. */
#define RP2040_DMA_CTRL_TRIG_EN                            (1 << 0)   /* DMA Channel Enable. When 1, the channel will respond to triggering events, which will cause it to become BUSY and start transferring data. When 0, the channel will ignore triggers, stop issuing transfers, and pause the current transfer sequence (i.e. BUSY will remain high if already high) */

#define RP2040_DMA_INTR_MASK                               (0xffff)  /* Raw interrupt status for DMA Channels 0..15. Bit n corresponds to channel n. Ignores any masking or forcing. Channel interrupts can be cleared by writing a bit mask to INTR, INTS0 or INTS1.  Channel interrupts can be routed to either of two system-level IRQs based on INTE0 and INTE1.  This can be used vector different channel interrupts to different ISRs: this might be done to allow NVIC IRQ preemption for more time-critical channels, or to spread IRQ load across different cores.  It is also valid to ignore this behaviour and just use INTE0/INTS0/IRQ 0. */

#define RP2040_DMA_INTE0_MASK                              (0xffff)  /* Set bit n to pass interrupts from channel n to DMA IRQ 0. */

#define RP2040_DMA_INTF0_MASK                              (0xffff)  /* Write 1s to force the corresponding bits in INTE0. The interrupt remains asserted until INTF0 is cleared. */

#define RP2040_DMA_INTS0_MASK                              (0xffff)  /* Indicates active channel interrupt requests which are currently causing IRQ 0 to be asserted. Channel interrupts can be cleared by writing a bit mask here. */

#define RP2040_DMA_INTE1_MASK                              (0xffff)  /* Set bit n to pass interrupts from channel n to DMA IRQ 1. */

#define RP2040_DMA_INTF1_MASK                              (0xffff)  /* Write 1s to force the corresponding bits in INTE0. The interrupt remains asserted until INTF0 is cleared. */

#define RP2040_DMA_INTS1_MASK                              (0xffff)  /* Indicates active channel interrupt requests which are currently causing IRQ 1 to be asserted. Channel interrupts can be cleared by writing a bit mask here. */

#define RP2040_DMA_TIMER0_X_SHIFT                          (16)  /* Pacing Timer Dividend. Specifies the X value for the (X/Y) fractional timer. */
#define RP2040_DMA_TIMER0_X_MASK                           (0xffff << RP2040_DMA_TIMER0_X_SHIFT)
#define RP2040_DMA_TIMER0_Y_MASK                           (0xffff)  /* Pacing Timer Divisor. Specifies the Y value for the (X/Y) fractional timer. */

