mdepx/mdepx/arch/arm/raspberrypi/rp2040_dma_regs.h
#define RP2040_DMA_TIMER1_X_SHIFT                          (16)  /* Pacing Timer Dividend. Specifies the X value for the (X/Y) fractional timer. */
#define RP2040_DMA_TIMER1_X_MASK                           (0xffff << RP2040_DMA_TIMER1_X_SHIFT)
#define RP2040_DMA_TIMER1_Y_MASK                           (0xffff)  /* Pacing Timer Divisor. Specifies the Y value for the (X/Y) fractional timer. */

#define RP2040_DMA_TIMER2_X_SHIFT                          (16)  /* Pacing Timer Dividend. Specifies the X value for the (X/Y) fractional timer. */
#define RP2040_DMA_TIMER2_X_MASK                           (0xffff << RP2040_DMA_TIMER2_X_SHIFT)
#define RP2040_DMA_TIMER2_Y_MASK                           (0xffff)  /* Pacing Timer Divisor. Specifies the Y value for the (X/Y) fractional timer. */

#define RP2040_DMA_TIMER3_X_SHIFT                          (16)       /* Pacing Timer Dividend. Specifies the X value for the (X/Y) fractional timer. */
#define RP2040_DMA_TIMER3_X_MASK                           (0xffff << RP2040_DMA_TIMER3_X_SHIFT)
#define RP2040_DMA_TIMER3_Y_MASK                           (0xffff)   /* Pacing Timer Divisor. Specifies the Y value for the (X/Y) fractional timer. */

#define RP2040_DMA_MULTI_CHAN_TRIGGER_MASK                 (0xffff)   /* Each bit in this register corresponds to a DMA channel. Writing a 1 to the relevant bit is the same as writing to that channel's trigger register; the channel will start if it is currently enabled and not already busy. */

#define RP2040_DMA_SNIFF_CTRL_OUT_INV                      (1 << 11)  /* If set, the result appears inverted (bitwise complement) when read. This does not affect the way the checksum is calculated; the result is transformed on-the-fly between the result register and the bus. */
#define RP2040_DMA_SNIFF_CTRL_OUT_REV                      (1 << 10)  /* If set, the result appears bit-reversed when read. This does not affect the way the checksum is calculated; the result is transformed on-the-fly between the result register and the bus. */
#define RP2040_DMA_SNIFF_CTRL_BSWAP                        (1 << 9)   /* Locally perform a byte reverse on the sniffed data, before feeding into checksum.  Note that the sniff hardware is downstream of the DMA channel byteswap performed in the read master: if channel CTRL_BSWAP and SNIFF_CTRL_BSWAP are both enabled, their effects cancel from the sniffer's point of view. */
#define RP2040_DMA_SNIFF_CTRL_CALC_SHIFT                   (5)
#define RP2040_DMA_SNIFF_CTRL_CALC_MASK                    (0x0f << RP2040_DMA_SNIFF_CTRL_CALC_SHIFT)
#define RP2040_DMA_SNIFF_CTRL_CALC_CRC32                   (0x0 << RP2040_DMA_SNIFF_CTRL_CALC_SHIFT)  /* Calculate a CRC-32 (IEEE802.3 polynomial) */
#define RP2040_DMA_SNIFF_CTRL_CALC_CRC32R                  (0x1 << RP2040_DMA_SNIFF_CTRL_CALC_SHIFT)  /* Calculate a CRC-32 (IEEE802.3 polynomial) with bit reversed data */
#define RP2040_DMA_SNIFF_CTRL_CALC_CRC16                   (0x2 << RP2040_DMA_SNIFF_CTRL_CALC_SHIFT)  /* Calculate a CRC-16-CCITT */
#define RP2040_DMA_SNIFF_CTRL_CALC_CRC16R                  (0x3 << RP2040_DMA_SNIFF_CTRL_CALC_SHIFT)  /* Calculate a CRC-16-CCITT with bit reversed data */
#define RP2040_DMA_SNIFF_CTRL_CALC_EVEN                    (0xe << RP2040_DMA_SNIFF_CTRL_CALC_SHIFT)  /* XOR reduction over all data. == 1 if the total 1 population count is odd. */
#define RP2040_DMA_SNIFF_CTRL_CALC_SUM                     (0xf << RP2040_DMA_SNIFF_CTRL_CALC_SHIFT)  /* Calculate a simple 32-bit checksum (addition with a 32 bit accumulator) */
#define RP2040_DMA_SNIFF_CTRL_DMACH_SHIFT                  (1)                                        /* DMA channel for Sniffer to observe */
#define RP2040_DMA_SNIFF_CTRL_DMACH_MASK                   (0x0f << RP2040_DMA_SNIFF_CTRL_DMACH_SHIFT)
#define RP2040_DMA_SNIFF_CTRL_EN                           (1 << 0)                                   /* Enable sniffer */

#define RP2040_DMA_FIFO_LEVELS_RAF_LVL_SHIFT               (16)      /* Current Read-Address-FIFO fill level */
#define RP2040_DMA_FIFO_LEVELS_RAF_LVL_MASK                (0xff << RP2040_DMA_FIFO_LEVELS_RAF_LVL_SHIFT)
#define RP2040_DMA_FIFO_LEVELS_WAF_LVL_SHIFT               (8)       /* Current Write-Address-FIFO fill level */
#define RP2040_DMA_FIFO_LEVELS_WAF_LVL_MASK                (0xff << RP2040_DMA_FIFO_LEVELS_WAF_LVL_SHIFT)
#define RP2040_DMA_FIFO_LEVELS_TDF_LVL_MASK                (0xff)    /* Current Transfer-Data-FIFO fill level */

#define RP2040_DMA_CHAN_ABORT_MASK                         (0xffff)  /* Each bit corresponds to a channel. Writing a 1 aborts whatever transfer sequence is in progress on that channel. The bit will remain high until any in-flight transfers have been flushed through the address and data FIFOs.  After writing, this register must be polled until it returns all-zero. Until this point, it is unsafe to restart the channel. */

#define RP2040_DMA_N_CHANNELS_MASK                         (0x1f)

#define RP2040_DMA_DBG_CTDREQ_MASK                         (0x3f)

#endif /* __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_DMA_H */
